r"""°°°
#### Задача 1. 

Напишите функцию, которая будет делить строчку на слова. Избавляться от пунктуации можно при помощи модуля string или метода str.maketrans. Функция должна возвращать генератор, который будет выдавать одно слово за другим.
°°°"""
# |%%--%%| <FIRlPPhRGb|oBZSbLI4ut>

# your code here
print("Hello, World")
print("Hello, Mom")

# |%%--%%| <oBZSbLI4ut|GOmba4KDxK>
r"""°°°
#### Задача 2. 

Шифр Цезаря - самый простой и известный способ шифровать свои данные. Его смысл в том, чтобы все буквы заменить по алфавиту со сдвигом, например, если сдвиг = 2, то буква а превратится в в, б - в г и так далее. Я будет превращаться в б. (Подробнее можно почитать на вики).

Напишите функцию для расшифровки строки. Функция принимает строку и число = сдвиг и должна вернуть расшифрованную строку.
°°°"""
# |%%--%%| <GOmba4KDxK|yzOIGyIe8j>

# your code here

# |%%--%%| <yzOIGyIe8j|FCKbOqkpiu>
r"""°°°
#### Задача 3. 

Напишите функцию ngrams, которая будет возвращать все n-грамы для списка с любым количеством элементов (слов). Например:

    ngrams([1, 2, 3], 2) -> [[1, 2], [2, 3]]
    
Есть ли готовые реализации такой функции? (свою собственную все равно напишите...)
°°°"""
# |%%--%%| <FCKbOqkpiu|H6rMHmnwa2>

# your code here

# |%%--%%| <H6rMHmnwa2|d3naq13dHC>
r"""°°°
#### Задача 4. 

Допустим, у нас есть функция, которая возвращает сумму своих аргументов. Напишите декоратор, который будет позволять такой функции складывать попарно элементы в кортежах, которые передаются списком, то есть, список [(1, 2), (3, 4)] вернет [3, 7].
°°°"""
# |%%--%%| <d3naq13dHC|ltmBLUiQNj>

# your code here

# |%%--%%| <ltmBLUiQNj|39DvpFgPIn>
r"""°°°
#### Задача 5. 

Дано число x. Функция должна возвращать True, если число является степенью 3, и False в обратном случае. Например: 27 => True (27 == 3 \*\* 3)
°°°"""
# |%%--%%| <39DvpFgPIn|dD0DvGNkwj>

# your code here

# |%%--%%| <dD0DvGNkwj|LziOD3ftZ6>
r"""°°°
#### Задача 6 (5 баллов).

Даны числа от 1 до n (1, 2, 3, ... n), а также число k < n!. Выведите k-ю перестановку для этих чисел. 
°°°"""
# |%%--%%| <LziOD3ftZ6|lXr09S34HG>

# your code here
